      *> SPDX-License-Identifier: Apache-2.0
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PACKETCHECKSUM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESULT-VALUE PIC 9(4) COMP.
       LINKAGE SECTION.
       01 INPUT-DATA PIC X(8).
       PROCEDURE DIVISION USING INPUT-DATA.
           COMPUTE RESULT-VALUE = FUNCTION ORD(INPUT-DATA(1:1))
           GOBACK.
